иб/src/Catalogs/Препараты/Препараты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Препараты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вакцина</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПрименения</name>
    <type>
      <types>CatalogRef.СпособыПримененияПрепаратов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.сжсвСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПодсосных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСписания</name>
    <type>
      <types>EnumRef.сжсвМетодыРаспределенияМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РекомендацииПоПрименению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВывода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.новФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗаказа</name>
    <type>
      <types>EnumRef.сжсвМетодыРаспределенияВетПрепарата</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрепарата</name>
    <type>
      <types>EnumRef.сжсвТипыВетПрепаратов</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструкция</name>
    <type>
      <types>CatalogRef.новФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоражаемыеЗаболевания</name>
    <attributes>
      <name>Заболевание</name>
      <type>
        <types>CatalogRef.Заболевания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоражаемыеВозбудители</name>
    <attributes>
      <name>Возбудитель</name>
      <type>
        <types>CatalogRef.Возбудители</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Catalogs/Препараты/ManagerModule.bsl
#Область Печати

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Препараты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Препараты.Вакцина,
	|	Препараты.ДляПодсосных,
	|	Препараты.ЕдиницаДляОтчетов,
	|	Препараты.ЕдиницаИзмерения,
	|	Препараты.ЕдиницаХраненияОстатков,
	|	Препараты.Инструкция,
	|	Препараты.Картинка,
	|	Препараты.Код,
	|	Препараты.Кратность,
	|	Препараты.КратностьРаспределения,
	|	Препараты.МаксимальныйЗаказ,
	|	Препараты.Наименование,
	|	Препараты.НормаРаспределения,
	|	Препараты.НормаРасхода,
	|	Препараты.Описание,
	|	Препараты.ПолноеНаименование,
	|	Препараты.Производитель,
	|	Препараты.РекомендацииПоПрименению,
	|	Препараты.Состав,
	|	Препараты.СпособПрименения,
	|	Препараты.СпособРаспределенияЗаказа,
	|	Препараты.СпособСписания,
	|	Препараты.СрокВывода,
	|	Препараты.СтавкаНДС,
	|	Препараты.СтраховойЗапас,
	|	Препараты.ТипПрепарата,
	|	Препараты.ТочкаЗаказа,
	|	Препараты.ПоражаемыеЗаболевания.(
	|		Заболевание
	|	),
	|	Препараты.ПоражаемыеВозбудители.(
	|		Возбудитель
	|	)
	|ИЗ
	|	Справочник.Препараты КАК Препараты
	|ГДЕ
	|	Препараты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоражаемыеЗаболеванияШапка = Макет.ПолучитьОбласть("ПоражаемыеЗаболеванияШапка");
	ОбластьПоражаемыеЗаболевания = Макет.ПолучитьОбласть("ПоражаемыеЗаболевания");
	ОбластьПоражаемыеВозбудителиШапка = Макет.ПолучитьОбласть("ПоражаемыеВозбудителиШапка");
	ОбластьПоражаемыеВозбудители = Макет.ПолучитьОбласть("ПоражаемыеВозбудители");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоражаемыеЗаболеванияШапка);
		ВыборкаПоражаемыеЗаболевания = Выборка.ПоражаемыеЗаболевания.Выбрать();
		Пока ВыборкаПоражаемыеЗаболевания.Следующий() Цикл
			ОбластьПоражаемыеЗаболевания.Параметры.Заполнить(ВыборкаПоражаемыеЗаболевания);
			ТабДок.Вывести(ОбластьПоражаемыеЗаболевания, ВыборкаПоражаемыеЗаболевания.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПоражаемыеВозбудителиШапка);
		ВыборкаПоражаемыеВозбудители = Выборка.ПоражаемыеВозбудители.Выбрать();
		Пока ВыборкаПоражаемыеВозбудители.Следующий() Цикл
			ОбластьПоражаемыеВозбудители.Параметры.Заполнить(ВыборкаПоражаемыеВозбудители);
			ТабДок.Вывести(ОбластьПоражаемыеВозбудители, ВыборкаПоражаемыеВозбудители.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

#КонецОбласти
